# ExportLinetypeTable Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLinetypeTable Constructor
ExportLinetypeTable Class See Also
---
Constructs a new ExportLinetypeTable with default values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ExportLinetypeTable()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ExportLinetypeTable()
```

# See Also
ExportLinetypeTable Class
Autodesk.Revit.DB Namespace